harishankarn04/MIMXRT1064_Project_LED/sdmmc/sdio/fsl_sdio.c
            /* check card capability of support async interrupt */
            if ((tempBuffer[kSDIO_RegInterruptExtension] & SDIO_CCCR_ASYNC_INT_MASK) == SDIO_CCCR_ASYNC_INT_MASK)
            {
                card->cccrflags |= SDIO_CCCR_SUPPORT_ASYNC_INT;
            }

            break;

        case kSDIO_FunctionNum1:
        case kSDIO_FunctionNum2:
        case kSDIO_FunctionNum3:
        case kSDIO_FunctionNum4:
        case kSDIO_FunctionNum5:
        case kSDIO_FunctionNum6:
        case kSDIO_FunctionNum7:
            card->ioFBR[(uint32_t)func - 1U].ioStdFunctionCode = tempBuffer[0U] & 0x0FU;
            card->ioFBR[(uint32_t)func - 1U].ioExtFunctionCode = tempBuffer[1U];
            card->ioFBR[(uint32_t)func - 1U].ioPointerToCIS =
                tempBuffer[9U] | ((uint32_t)tempBuffer[10U] << 8U) | ((uint32_t)tempBuffer[11U] << 16U);
            card->ioFBR[(uint32_t)func - 1U].ioPointerToCSA =
                tempBuffer[12U] | ((uint32_t)tempBuffer[13U] << 8U) | ((uint32_t)tempBuffer[14U] << 16U);
            if ((tempBuffer[2U] & 0x01U) != 0U)
            {
                card->ioFBR[(uint32_t)func - 1U].flags |= (uint8_t)kSDIO_FBRSupportPowerSelection;
            }
            if ((tempBuffer[0U] & 0x40U) != 0U)
            {
                card->ioFBR[(uint32_t)func - 1U].flags |= (uint8_t)kSDIO_FBRSupportCSA;
            }

            break;

        default:
            assert(false);
            break;
    }

    return kStatus_Success;
}

status_t SDIO_SetBlockSize(sdio_card_t *card, sdio_func_num_t func, uint32_t blockSize)
{
    assert(card != NULL);
    assert(func <= kSDIO_FunctionNum7);
    assert(blockSize <= SDIO_MAX_BLOCK_SIZE);

    uint8_t temp   = 0U;
    status_t error = kStatus_Success;

    /* check the block size for block mode
     * so you need read CIS for each function first,before you do read/write
     */
    if ((func == kSDIO_FunctionNum0) && (card->commonCIS.fn0MaxBlkSize != 0U) &&
        (blockSize > card->commonCIS.fn0MaxBlkSize))
    {
        return kStatus_SDMMC_SDIO_InvalidArgument;
    }
    else if ((func != kSDIO_FunctionNum0) && (card->funcCIS[(uint32_t)func - 1U].ioMaxBlockSize != 0U) &&
             (blockSize > card->funcCIS[(uint32_t)func - 1U].ioMaxBlockSize))
    {
        return kStatus_SDMMC_SDIO_InvalidArgument;
    }
    else
    {
        /* Intentional empty */
    }

    temp = (uint8_t)(blockSize & 0xFFU);

    error =
        SDIO_IO_Access_Direct(card, kSDIO_IOWrite, kSDIO_FunctionNum0,
                              SDIO_FBR_BASE((uint32_t)func) + (uint32_t)kSDIO_RegFN0BlockSizeLow, temp, &temp, true);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SetCardBlockSizeFailed;
    }

    temp = (uint8_t)((blockSize >> 8U) & 0xFFU);

    error =
        SDIO_IO_Access_Direct(card, kSDIO_IOWrite, kSDIO_FunctionNum0,
                              SDIO_FBR_BASE((uint32_t)func) + (uint32_t)kSDIO_RegFN0BlockSizeHigh, temp, &temp, true);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SetCardBlockSizeFailed;
    }

    /* record the current block size */
    if (func == kSDIO_FunctionNum0)
    {
        card->io0blockSize = blockSize;
    }
    else
    {
        card->ioFBR[(uint32_t)func - 1U].ioBlockSize = (uint16_t)blockSize;
    }

    return kStatus_Success;
}

status_t SDIO_CardReset(sdio_card_t *card)
{
    status_t error = kStatus_Success;

    error = SDIO_IO_Access_Direct(card, kSDIO_IOWrite, kSDIO_FunctionNum0, kSDIO_RegIOAbort, 0x08U, NULL, false);
    if (error != kStatus_Success)
    {
        error = kStatus_SDMMC_TransferFailed;
    }

    return error;
}

status_t SDIO_SetDataBusWidth(sdio_card_t *card, sdio_bus_width_t busWidth)
{
    assert(card != NULL);

    uint8_t regBusInterface = 0U;
    status_t error          = kStatus_Success;

    if (((busWidth == kSDIO_DataBus4Bit) && ((card->cccrflags & (uint32_t)kSDIO_CCCRSupportHighSpeed) == 0U) &&
         ((card->cccrflags & (uint32_t)kSDIO_CCCRSupportLowSpeed4Bit) == 0U)))
    {
        return kStatus_SDMMC_SDIO_InvalidArgument;
    }

    if ((((card->cccrflags & SDIO_CCCR_SUPPORT_8BIT_BUS) == 0U) ||
         ((card->usrParam.capability & (uint32_t)kSDMMC_Support8BitWidth) == 0U) ||
         ((card->host->capability & (uint32_t)kSDMMCHOST_Support8BitDataWidth) == 0U)) &&
        (busWidth == kSDIO_DataBus8Bit))
    {
        return kStatus_SDMMC_SDIO_InvalidArgument;
    }

    /* load bus interface register */
    error = SDIO_IO_Access_Direct(card, kSDIO_IORead, kSDIO_FunctionNum0, kSDIO_RegBusInterface, 0U, &regBusInterface,
                                  false);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }
    /* set bus width */
    regBusInterface &= 0xFCU;
    regBusInterface |= (uint8_t)busWidth;

    /* write to register */
    error = SDIO_IO_Access_Direct(card, kSDIO_IOWrite, kSDIO_FunctionNum0, kSDIO_RegBusInterface, regBusInterface,
                                  &regBusInterface, true);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

#if SDMMCHOST_SUPPORT_8_BIT_WIDTH
    if (busWidth == kSDIO_DataBus8Bit)
    {
        SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith8Bit);
    }
    else
#endif
        if (busWidth == kSDIO_DataBus4Bit)
    {
        SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith4Bit);
    }
    else
    {
        SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith1Bit);
    }

    return kStatus_Success;
}

static status_t SDIO_SetMaxDataBusWidth(sdio_card_t *card)
{
    sdio_bus_width_t busWidth = kSDIO_DataBus1Bit;

    if (((card->cccrflags & SDIO_CCCR_SUPPORT_8BIT_BUS) != 0U) &&
        ((card->usrParam.capability & (uint32_t)kSDMMC_Support8BitWidth) != 0U) &&
        ((card->host->capability & (uint32_t)kSDMMCHOST_Support8BitDataWidth) != 0U))
    {
        busWidth = kSDIO_DataBus8Bit;
    }
    /* switch data bus width */
    else if ((((card->cccrflags & (uint32_t)kSDIO_CCCRSupportHighSpeed) != 0U) ||
              ((card->cccrflags & (uint32_t)kSDIO_CCCRSupportLowSpeed4Bit) != 0U)) &&
             ((card->host->capability & (uint32_t)kSDMMCHOST_Support4BitDataWidth) != 0U))
    {
        busWidth = kSDIO_DataBus4Bit;
    }
    else
    {
        busWidth = kSDIO_DataBus1Bit;
    }

    return SDIO_SetDataBusWidth(card, busWidth);
}

status_t SDIO_SwitchToHighSpeed(sdio_card_t *card)
{
    assert(card != NULL);

